Tekla Open API Reference for Tekla Structures 2025
WpfCreateApplyCancel Events
The WpfCreateApplyCancel type exposes the following members.
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
CreateClicked
 The ApplyClicked event is raised when the Apply button is clicked.
Top
See Also
Reference
WpfCreateApplyCancel Class
Tekla.Structures.Dialog.UIControls Namespace